[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:25:14
     return (
 
         <Form onSubmit={handleSubmit(submitAction)}>
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid="MenuItemReviewForm-id"
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
 
             <Form.Group className="mb-3" >
killedBy: MenuItemReviewForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:25:14
     return (
 
         <Form onSubmit={handleSubmit(submitAction)}>
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid="MenuItemReviewForm-id"
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
 
             <Form.Group className="mb-3" >
killedBy: MenuItemReviewForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:46:44
                     id="itemId"
                     type="text"
                     isInvalid={Boolean(errors.itemId)}
-                    {...register("itemId", {
-                        required: "Item Id is required."
-                    })}
+                    {...register("itemId", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Item Id is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:46:34
                     id="itemId"
                     type="text"
                     isInvalid={Boolean(errors.itemId)}
-                    {...register("itemId", {
+                    {...register("", {
                         required: "Item Id is required."
                     })}
killedBy: MenuItemReviewForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:47:35
                     type="text"
                     isInvalid={Boolean(errors.itemId)}
                     {...register("itemId", {
-                        required: "Item Id is required."
+                        required: ""
                     })}
                 />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Item Id is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:62:51
                     id="reviewerEmail"
                     type="text"
                     isInvalid={Boolean(errors.reviewerEmail)}
-                    {...register("reviewerEmail", {
-                        required: "Email is required."
-                    })}
+                    {...register("reviewerEmail", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:63:35
                     type="text"
                     isInvalid={Boolean(errors.reviewerEmail)}
                     {...register("reviewerEmail", {
-                        required: "Email is required."
+                        required: ""
                     })}
                 />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:78:43
                     id="stars"
                     type="text"
                     isInvalid={Boolean(errors.stars)}
-                    {...register("stars", {
-                        required: true,
-                        max : 5
-                    })}
+                    {...register("stars", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:79:35
                     type="text"
                     isInvalid={Boolean(errors.stars)}
                     {...register("stars", {
-                        required: true,
+                        required: false,
                         max : 5
                     })}
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:84:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.stars && 'Stars are required.'}
+                    {true}
                     {errors.stars?.type === 'max' && 'Max rating of 5 stars'}
                 </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:84:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.stars && 'Stars are required.'}
+                    {errors.stars || 'Stars are required.'}
                     {errors.stars?.type === 'max' && 'Max rating of 5 stars'}
                 </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:85:22
                 />
                 <Form.Control.Feedback type="invalid">
                     {errors.stars && 'Stars are required.'}
-                    {errors.stars?.type === 'max' && 'Max rating of 5 stars'}
+                    {errors.stars.type === 'max' && 'Max rating of 5 stars'}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] EqualityOperator
main/components/MenuItemReview/MenuItemReviewForm.js:85:22
                 />
                 <Form.Control.Feedback type="invalid">
                     {errors.stars && 'Stars are required.'}
-                    {errors.stars?.type === 'max' && 'Max rating of 5 stars'}
+                    {errors.stars?.type !== 'max' && 'Max rating of 5 stars'}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Max rating of 5 stars</div> instead

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:96:62
                     id="dateReviewed"
                     type="datetime-local"
                     isInvalid={Boolean(errors.dateReviewed)}
-                    {...register("dateReviewed", { required: true, pattern: isodate_regex })}
+                    {...register("dateReviewed", { required: false, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Reviewed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:96:50
                     id="dateReviewed"
                     type="datetime-local"
                     isInvalid={Boolean(errors.dateReviewed)}
-                    {...register("dateReviewed", { required: true, pattern: isodate_regex })}
+                    {...register("dateReviewed", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Reviewed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:99:22
                     {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.dateReviewed && 'Date Reviewed is required.'}
+                    {errors.dateReviewed || 'Date Reviewed is required.'}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:99:22
                     {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.dateReviewed && 'Date Reviewed is required.'}
+                    {false}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Reviewed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
