[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:9:33
 
 export default function UCSBDiningCommonsMenuItemCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (diningCommonsMenuItem) => ({
-        url: "/api/ucsbdiningcommonsmenuitem/post",
-        method: "POST",
-        params: {
-            diningCommonsCode: diningCommonsMenuItem.diningCommonsCode,
-            name: diningCommonsMenuItem.name,
-            station: diningCommonsMenuItem.station
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (diningCommonsMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /diningcommonsmenuitem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:9:61
 
 export default function UCSBDiningCommonsMenuItemCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (diningCommonsMenuItem) => ({
-        url: "/api/ucsbdiningcommonsmenuitem/post",
-        method: "POST",
-        params: {
-            diningCommonsCode: diningCommonsMenuItem.diningCommonsCode,
-            name: diningCommonsMenuItem.name,
-            station: diningCommonsMenuItem.station
-        }
-    });
+    const objectToAxiosParams = (diningCommonsMenuItem) => ({});
 
     const onSuccess = (diningCommonsMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /diningcommonsmenuitem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:19:50
         }
     });
 
-    const onSuccess = (diningCommonsMenuItem) => {
-        toast(`New Dining Commons Menu Item Created - id: ${diningCommonsMenuItem.id} name: ${diningCommonsMenuItem.name}`);
-    }
+    const onSuccess = (diningCommonsMenuItem) => {}
 
     const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /diningcommonsmenuitem
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Dining Commons Menu Item Created - id: 3 name: Burger"

Number of calls: 0
